#### Matloff gdb book

In this part we look at an example from Matloff and Salzman's book <i>The Art of Debugging with gdb ...</i>.

The program is [**insertion-sort.0.c**](../code/insertion-sort.0.c).  I typed it in with a few changes.  

The first was to add two needed library ``include``s:

```
#include <stdio.h>
#include <stdlib.h>
```

I also made the arrays smaller so the printing would be nicer.

And then tried to compile it:

```
clang code/insertion-sort.0.c -Wall -o exe/insert
```

I fixed an error of theirs (``24    if (num_y = 0) {``), which the compiler complained about, and then fixed my typos until it ran.

Then I compiled it again with debugging symbols:

```
clang code/insertion-sort.0.c -g -Wall -o exe/insert
```

#### The ``get_args`` function

Let's run it and see what happens.

```
> clang code/insertion-sort.0.c -g -Wall -o exe/insert
> exe/insert 1 2 3
3
0
0
> exe/insert 3 2 1
Bus error: 10
>
```

Looks like we've got some issues.  First run

```
> export PATH=/usr/bin
```

Then

```
> lldb exe/insert 3 2 1
(lldb) target create "exe/insert"
Current executable set to 'exe/insert' (x86_64).
(lldb) settings set -- target.run-args  "3" "2" "1"
```

We need a breakpoint.

```
(lldb) b main
Breakpoint 1: where = insert`main + 15 at insertion-sort.orig.c:50, address = 0x0000000100000f5f
(lldb) r
Process 3659 launched: '/Users/telliott_admin/Desktop/debug/exe/insert' (x86_64)
Process 3659 stopped
* thread #1, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
    frame #0: 0x0000000100000f5f insert`main(argc=4, argv=0x00007ffeefbffa08) at insertion-sort.orig.c:50
   47  	}
   48  	
   49  	int main (int argc, char ** argv) {
-> 50  	  get_args(argc, argv);
   51  	  process_data();
   52  	  print_results();
   53  	}
Target 0: (insert) stopped.
```

If we look at the array ``x`` at this point, we'll see it's zeroed out (which is moderately surprising):

```
(lldb) p x
(int [5]) $0 = ([0] = 0, [1] = 0, [2] = 0, [3] = 0, [4] = 0)
```

Now step over with ``n``

```
...
   50  	  get_args(argc, argv);
-> 51  	  process_data();
   52  	  print_results();
...

```

And

```
(lldb) p x
(int [5]) $1 = ([0] = 3, [1] = 2, [2] = 1, [3] = 0, [4] = 0)
```

So we have the data.

The logic of ``getargs`` looks good and so does the result.

#### ``continue`` to seg fault

```
(lldb) continue
Process 3659 resuming
Process 3659 stopped
* thread #1, queue = 'com.apple.main-thread', stop reason = EXC_BAD_ACCESS (code=2, address=0x100002000)
    frame #0: 0x0000000100000e06 insert`scoot_over(jj=0) at insertion-sort.orig.c:19
   16  	void scoot_over(int jj) {
   17  	  int k;
   18  	  for (k = num_y - 1; k > jj;  k++)
-> 19  	    y[k] = y[k-1];
   20  	}
   21  	
   22  	void insert(int new_y) {
Target 0: (insert) stopped.
```

We have a ``EXC_BAD_ACCESS`` at ``address=0x100002000`` which explains ``Bus error: 10`` obtained when we simply tried to run the program.  

It happens when we try

```
-> 19  	    y[k] = y[k-1];
```

So

```
(lldb) p k
(int) $2 = 1004
```

Our loop variable ``k`` has a value of ``1004``!

```
(lldb) p y
(int [5]) $3 = ([0] = 2, [1] = 2, [2] = 2, [3] = 2, [4] = 2)
```

The array ``y`` is full of ``2``'s.  The address of ``y`` is

```
(lldb) p &y
(int (*)[5]) $4 = 0x0000000100001050
```

Look at some bytes near the address of ``y``

```
(lldb) x/24b &y
0x100001050: 0x02 0x00 0x00 0x00 0x02 0x00 0x00 0x00
0x100001058: 0x02 0x00 0x00 0x00 0x02 0x00 0x00 0x00
0x100001060: 0x02 0x00 0x00 0x00 0x02 0x00 0x00 0x00
```

As expected, we are writing 4-byte integers with the value ``2`` to the array ``y``, but the values extend well past then end of ``y`` only four bytes are shown here. 

The bytes just upstream of ``y`` are zeroed out.

```
(lldb) x/8b 0x100001042
0x100001042: 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00
```

In fact the ``2``'s extend all the way to the address that triggered ``EXC_BAD_ACCESS``, ``0x100002000``.

```
(lldb) x/4024b &y --force
0x100001050: 0x02 0x00 0x00 0x00 0x02 0x00 0x00 0x00
...
0x100001ff8: 0x02 0x00 0x00 0x00 0x02 0x00 0x00 0x00
0x100002000: 0x11 0x22 0x10 0x52 0x00 0x00 0x00 0x00
```
That's 4016 bytes worth of ``2``, which explains how ``k`` got so large.

Let's look at some code to see if we can figure out the problem.

#### ``scoot_over``

```
void scoot_over(int jj) {
  for (int k = num_y - 1; k > jj;  k++)
    y[k] = y[k-1];
}
```

The idea is, we maintain an output array ``y`` with values in sorted order, followed by zeroes.  The count of values in that array is ``num_y``.  

For each value from ``x`` we go across ``y`` until we find a value which is greater than the new one, and when we've found the right place, we want to ``insert`` a new y value at position ``j``, so we call ``scoot_over(j)`` (which comes in as the local variable ``jj``). 

We are scooting to the right, starting with the top value.  So it's pretty clear that one error is ``k++`` should be ``k--``.

With ``k++`` we do ``y[k] = y[k-1]`` and increment ``k``, and the condition ``k > jj`` is always true.

Make the change to ``k--`` and save as ``../code/insertion-sort.0.c``, recompile 

```
> clang code/insertion-sort.1.c -g -Wall -o exe/insert
```

and then

```
> exe/insert 1 2 3
3
0
0
> exe/insert 3 2 1
1
2
0
>
```

The bus error is gone, but the result is still not correct.

So, start the debugger again and do

```
> lldb exe/insert 3 2 1
```

and then ``b scoot_over``.

```
(lldb) b scoot_over
Breakpoint 1: where = insert`scoot_over + 7 at insertion-sort.1.c:18, address = 0x0000000100000dd7
(lldb) r
Process 3735 launched: '/Users/telliott_admin/Desktop/debug/exe/insert' (x86_64)
Process 3735 stopped
* thread #1, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
    frame #0: 0x0000000100000dd7 insert`scoot_over(jj=0) at insertion-sort.1.c:18
   15  	
   16  	void scoot_over(int jj) {
   17  	  int k;
-> 18  	  for (k = num_y - 1; k > jj;  k--)
   19  	    y[k] = y[k-1];
   20  	}
   21  	
Target 0: (insert) stopped.
```

And now start looking at variables.  The globals are fine.

```
(lldb) ta v
Global variables for /Users/telliott_admin/Desktop/debug/code/insertion-sort.1.c in /Users/telliott_admin/Desktop/debug/exe/insert:
(int) n = 3
(int [5]) x = ([0] = 3, [1] = 2, [2] = 1, [3] = 0, [4] = 0)
(int [5]) y = ([0] = 3, [1] = 0, [2] = 0, [3] = 0, [4] = 0)
(int) num_y = 1
```

The ``3`` was correctly inserted in ``y[0]``, before ``scoot_over`` is even called for the first time. The local or "frame" variables are

```
(lldb) fr v
(int) jj = 0
(int) k = 0
```

``k`` is ``0``, not yet set to the value ``num_y - 1``.  ``jj`` is set to ``0`` as expected.  

But there's a problem, namely that ``num_y`` is ``1``, so ``k`` will be set to zero, and the condition ``k > jj`` will fail so the loop won't execute.

So ``step`` with ``s``:

```
-> 20  	}
```

``step`` steps over the loop.  ``y`` is unchanged!  

```
(lldb) p y
(int [5]) $0 = ([0] = 3, [1] = 0, [2] = 0, [3] = 0, [4] = 0)
```

Change the code to ``k = num_y``, save it as ```` and try again.

```
> exe/insert 3 2 1
1
2
3
>
```

Go back and look again.  We step into the loop.  ``k`` equals ``1`` as it should.  After the second step and assignment, 

```
(lldb) p y
(int [10]) $1 = ([0] = 3, [1] = 3, [2] = 0 ..
```

as expected.  We go back to ``insert`` and get

```
(int [10]) $3 = ([0] = 2, [1] = 3, [2] = 0,
```

That all looks good!  What about

```
> exe/insert 1 2 3
1
0
0
>
```

There is yet another error!  ``insert``:

```
void insert(int new_y) {
  int j;
  if (num_y == 0) {
    y[0] = new_y;
    return;
  }
  for (j = 0; j < num_y; j++){
    if (new_y < y[j])
      scoot_over(j);   
      y[j] = new_y;
      return;
  }
}
```

works for ``3 2 1``, but that's a special case:

```
> exe/insert 3 1 2
2
3
0
>
```

And the reason for this is that when ``new_y >= y[j]`` we never write it.  

Modify and save as ``exe/insertion-sort.c``

```
void insert(int new_y) {
  int j;
  if (num_y == 0) {
    y[0] = new_y;
    return;
  }
  for (j = 0; j < num_y; j++){
    if (new_y < y[j]) {
      scoot_over(j); 
      y[j] = new_y;
      return;
    }  
  }
  y[j] = new_y;
}
```

```
> clang code/insertion-sort.c -g -Wall -o exe/insert
> exe/insert 1 2 3
1
2
3
> exe/insert 3 2 1
1
2
3
> exe/insert 3 1 2
1
2
3
> 
```

Seems to be fine.